CSI API ETABS v1
cHelper.CreateObject Method
 Starts the program at the given path.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
cOAPI CreateObject(
	string fullPath
)
Function CreateObject (
	fullPath As String
) As cOAPI
Dim instance As cHelper
Dim fullPath As String
Dim returnValue As cOAPI
returnValue = instance.CreateObject(fullPath)
cOAPI^ CreateObject(
	String^ fullPath
)
abstract CreateObject :
        fullPath : string -> cOAPI
Parameters
fullPath
Type: System.String
The full path to the program executable.
Return Value
Type: cOAPI
An instance of cOAPI if successful, nothing otherwise.
Remarks
Examples
Public Sub Example()
    Dim myHelper As cHelper
    Dim SapModel As cSapModel
    Dim EtabsObject As cOAPI
    Dim ret As Integer = -1
    'create ETABS object
    myHelper = New Helper
    EtabsObject = myHelper.CreateObject("C:\Program Files\Computers and Structures\ETABS 19\ETABS.exe")
    'start ETABS application
    ret = EtabsObject.ApplicationStart()
    'create SapModel object
    SapModel = EtabsObject.SapModel
    'initialize model
    ret = SapModel.InitializeNewModel()
    'close ETABS
    EtabsObject.ApplicationExit(False)
    'clean up variables
    SapModel = Nothing
    EtabsObject = Nothing
    myHelper = Nothing
End Sub
See Also
Reference
cHelper Interface
ETABSv1 Namespace